In [2]:
# import pandas library
import pandas as pd
import datetime

## First file: `inscripcion_conferencia.csv`

In [3]:
# add first data file: inscripcion_conferencia.csv
inscripcion_conferencia = pd.read_csv("../BasesFinales/inscripcion_conferencia.csv", sep = ';', encoding='latin-1')

In [4]:
# (rows, columns)
inscripcion_conferencia.shape

(2199, 6)

In [5]:
inscripcion_conferencia.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2199 entries, 0 to 2198
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   IDEstudiante     2199 non-null   int64
 1   Nombre           2199 non-null   object
 2   FechaNacimiento  2199 non-null   object
 3   estudiante       2199 non-null   object
 4   Genero_completo  2199 non-null   object
 5   Ingresos         2199 non-null   int64
dtypes: int64(2), object(4)
memory usage: 103.2+ KB

In [6]:
inscripcion_conferencia.head()

,IDEstudiante,Nombre,FechaNacimiento,estudiante,Genero_completo,Ingresos
0,1,Marcos Morales Rubiano,25/08/2009,S,H,534847
1,2,Maria Rubiano Delgado,29/05/2011,N,M,1113050
2,3,Paula Contreras Delgado,8/06/1998,N,M,1249186
3,4,Carlos Medina Rubiano,11/07/1997,S,H,915811
4,5,Pablo Salazar Delgado,18/10/2005,S,H,1175867

In [7]:
# format date type
inscripcion_conferencia['FechaNacimiento'] = pd.to_datetime(inscripcion_conferencia['FechaNacimiento'], dayfirst = True)
inscripcion_conferencia.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2199 entries, 0 to 2198
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   IDEstudiante     2199 non-null   int64
 1   Nombre           2199 non-null   object
 2   FechaNacimiento  2199 non-null   datetime64[ns]
 3   estudiante       2199 non-null   object
 4   Genero_completo  2199 non-null   object
 5   Ingresos         2199 non-null   int64
dtypes: datetime64[ns](1), int64(2), object(3)
memory usage: 103.2+ KB

In [8]:
# verify number of unique values
inscripcion_conferencia['Nombre'].nunique(dropna=False)

2199

In [9]:
# verify unique values from column estudiante
inscripcion_conferencia['estudiante'].unique()

array(['S', 'N'], dtype=object)

The dictionary doesn't mention this column. It is asume that 'S' means 'SÃ­'(Yes) and 'N' to 'No', with respect to the state of the students.

In [10]:
# verify unique values from column Genero_completo
inscripcion_conferencia['Genero_completo'].unique()

array(['H', 'M'], dtype=object)

In [11]:
# verify unique values from column Ingresos
inscripcion_conferencia['Ingresos'].nunique(dropna=False)

2196

In [12]:
# There are three values repeated. Check which ones, if there are numbers or what?
inscripcion_conferencia['Ingresos'].value_counts(dropna=False, ascending=False).head()

Ingresos
1275706    2
994619     2
1340758    2
534847     1
910009     1
Name: count, dtype: int64

The file `inscripcion_conferencia.csv` doesn't present null values. Next, it will be check if there are any weird values.

In [13]:
# calculate age of the students to current year 2024.
current_year = 2024
inscripcion_conferencia['age'] = current_year - inscripcion_conferencia['FechaNacimiento'].dt.year
inscripcion_conferencia.head()

,IDEstudiante,Nombre,FechaNacimiento,estudiante,Genero_completo,Ingresos,age
0,1,Marcos Morales Rubiano,2009-08-25,S,H,534847,15
1,2,Maria Rubiano Delgado,2011-05-29,N,M,1113050,13
2,3,Paula Contreras Delgado,1998-06-08,N,M,1249186,26
3,4,Carlos Medina Rubiano,1997-07-11,S,H,915811,27
4,5,Pablo Salazar Delgado,2005-10-18,S,H,1175867,19

Statistics of numeric data

In [14]:
# eliminar posiciones decimales
pd.set_option('display.precision', 2)
pd.set_option('display.float_format', lambda x: '%.2f' % x)

inscripcion_conferencia.describe()

       IDEstudiante                FechaNacimiento   Ingresos     age
count       2199.00                           2199    2199.00 2199.00
mean        1100.00  2003-10-31 03:03:21.364256512 1003138.40   20.67
min            1.00            1993-10-12 00:00:00  502221.00   11.00
25%          550.50            1998-12-02 00:00:00  764890.00   16.00
50%         1100.00            2003-11-25 00:00:00 1039857.00   21.00
75%         1649.50            2008-09-24 00:00:00 1201420.50   26.00
max         2199.00            2013-09-27 00:00:00 1499407.00   31.00
std          634.94                            NaN  277300.06    5.71

No atypical value in the numeric columns seams to be.

In [15]:
# export transform data
inscripcion_conferencia.to_csv('..\BasesFinales\inscripcion_conferencia_transform.csv')

## Second file: `estudiantes.csv`

In [16]:
# add file estudiantes.csv
estudiantes = pd.read_csv('../BasesFinales/estudiantes.csv', sep=';', encoding='latin-1')
estudiantes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 976 entries, 0 to 975
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   IDEstudiante     976 non-null    int64
 1   Nombre           976 non-null    object
 2   FechaNacimiento  976 non-null    object
dtypes: int64(1), object(2)
memory usage: 23.0+ KB

In [17]:
estudiantes.head()

   IDEstudiante                  Nombre FechaNacimiento
0             1  Marcos Morales Rubiano      25/08/2009
1             2   Maria Rubiano Delgado      29/05/2011
2             5   Pablo Salazar Delgado      18/10/2005
3             6    Marcos JimÃ©nez MarÃ­n      16/12/2000
4             7         Luis Reyes RÃ­os      28/05/2011

In [18]:
# check unique names and count
estudiantes['Nombre'].nunique(dropna=False)

976

In [19]:
# convert date to datetime type
estudiantes['FechaNacimiento'] = pd.to_datetime(estudiantes['FechaNacimiento'], dayfirst=True)
estudiantes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 976 entries, 0 to 975
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   IDEstudiante     976 non-null    int64
 1   Nombre           976 non-null    object
 2   FechaNacimiento  976 non-null    datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 23.0+ KB

In [20]:
# add age column
estudiantes['age'] = current_year - estudiantes['FechaNacimiento'].dt.year
estudiantes.head()

   IDEstudiante                  Nombre FechaNacimiento  age
0             1  Marcos Morales Rubiano      2009-08-25   15
1             2   Maria Rubiano Delgado      2011-05-29   13
2             5   Pablo Salazar Delgado      2005-10-18   19
3             6    Marcos JimÃ©nez MarÃ­n      2000-12-16   24
4             7         Luis Reyes RÃ­os      2011-05-28   13

In [21]:
estudiantes.describe()

       IDEstudiante                FechaNacimiento    age
count        976.00                            976 976.00
mean         979.85  2004-03-06 16:46:13.770491776  20.32
min            1.00            1993-10-12 00:00:00  11.00
25%          504.75            1999-04-06 00:00:00  15.00
50%          949.00            2004-06-22 12:00:00  20.00
75%         1471.25            2009-04-04 06:00:00  25.00
max         1999.00            2013-09-22 00:00:00  31.00
std          575.27                            NaN   5.78

The data doesn't contain null values nor atypical. The column age was added.

In [22]:
# export transformed file
estudiantes.to_csv('../BasesFinales/estudiantes_transform.csv')

## Third file: `donantes_inscritos.csv`

In [23]:
# add file donantes_inscritos.csv
donantes_inscritos = pd.read_csv('../BasesFinales/donantes_inscritos.csv', sep=';', encoding = 'latin-1')
donantes_inscritos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4992 entries, 0 to 4991
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   IDDonante          4992 non-null   int64
 1   Nombres            4992 non-null   object
 2   CorreoElectronico  4992 non-null   object
 3   Telefono           4992 non-null   object
 4   Direccion          4992 non-null   object
 5   Ciudad             4992 non-null   object
 6   Estado             4992 non-null   object
 7   Pais               4992 non-null   object
 8   Codigopostal       4992 non-null   int64
dtypes: int64(2), object(7)
memory usage: 351.1+ KB

In [24]:
donantes_inscritos.sample(10)

,IDDonante,Nombres,CorreoElectronico,Telefono,Direccion,Ciudad,Estado,Pais,Codigopostal
1342,2402,Isabela Gutierrez Rodriguez,ugdofemi@example.com,774-4532,Calle Zona 1,Mexico DF,Distrito Federal,Mexico,1010
1746,1096,Gabriela Lopez Gonzalez,wzcq83sx@example.com,372-5190,Avenida 45 #67,Bogota,Bogota D.C.,Colombia,110111
595,3853,David Perez Rodriguez,13b1qb7q@example.com,272-1823,Avenida 45 #67,Bogota,Bogota D.C.,Colombia,110112
4754,82,Antonio Perez Garcia,cn377u6i@example.com,325-9287,Calle Zona 1,Mexico DF,Distrito Federal,Mexico,1010
1509,1527,Jose Vargas Morales,43q552qq@example.com,505-7277,Avenida 45 #67,Bogota,Bogota D.C.,Colombia,110112
3508,978,Luisana Garcia Garcia,0nsfzfh2@example.com,732-6609,Jiron Lima,Lima,Lima,Peru,15001
267,416,Lucia Gomez Martinez,q3oaymu2@example.com,750-2732,Avenida Dos,Santiago,Metropolitana,Chile,7500000
3563,1200,Luis Sanchez Romero,xgkpx0ts@example.com,199-3277,Avenida Cuzco,Lima,Lima,Peru,15001
2374,4088,Luis Martinez Sanchez,1lnlpega@example.com,995-1838,Avenida 45 #67,Bogota,Bogota D.C.,Colombia,110111
885,3394,Lucia Gomez Rodriguez,z05pediq@example.com,628-2676,Avenida Cuzco,Lima,Lima,Peru,15001

In [25]:
donantes_inscritos.nunique(dropna=False)

IDDonante            4992
Nombres              4992
CorreoElectronico    4992
Telefono             4991
Direccion              10
Ciudad                  5
Estado                  5
Pais                    5
Codigopostal           10
dtype: int64

In [26]:
donantes_inscritos['Telefono'].value_counts(dropna=False, ascending=False).head()

Telefono
287-2826    2
848-3536    1
687-9392    1
735-7556    1
108-2469    1
Name: count, dtype: int64

In [27]:
donantes_inscritos[donantes_inscritos['Telefono'] == '287-2826']

,IDDonante,Nombres,CorreoElectronico,Telefono,Direccion,Ciudad,Estado,Pais,Codigopostal
810,3182,Isabella Ortega Castro,przfpb37@example.com,287-2826,Avenida Cuzco,Lima,Lima,Peru,15001
3445,1484,Luisana Rodriguez Morales,6nw11q32@example.com,287-2826,Calle A,Buenos Aires,Buenos Aires,Argentina,1000

In [28]:
donantes_inscritos['Direccion'].unique()

array(['Jiron Lima', 'Calle A', 'Calle Zona 1', 'Avenida Cuzco',
       'Avenida Norte', 'Calle Uno', 'Avenida Dos', 'Calle 1 #23',
       'Avenida 45 #67', 'Avenida B'], dtype=object)

In [29]:
donantes_inscritos['Ciudad'].unique()

array(['Lima', 'Buenos Aires', 'Mexico DF', 'Santiago', 'Bogota'],
      dtype=object)

In [30]:
donantes_inscritos['Estado'].unique()

array(['Lima', 'Buenos Aires', 'Distrito Federal', 'Metropolitana',
       'Bogota D.C.'], dtype=object)

In [31]:
donantes_inscritos['Pais'].unique()

array(['Peru', 'Argentina', 'Mexico', 'Chile', 'Colombia'], dtype=object)

In [32]:
donantes_inscritos['Codigopostal'].unique()

array([  15002,    1001,    1010,   15001,    1011, 7500000, 7500001,
        110111,  110112,    1000], dtype=int64)

## Fourth file: `donaciones.csv`

In [33]:
donaciones = pd.read_csv('../BasesFinales/donaciones.csv', sep=';', encoding='latin-1')
donaciones.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   IDDonacion      20000 non-null  int64
 1   IDDonante       20000 non-null  int64
 2   Cantidad        20000 non-null  float64
 3   FechaDonacion   20000 non-null  object
 4   MetodoDonacion  20000 non-null  object
 5   Comentario      11882 non-null  object
 6   EsAnonimo       20000 non-null  bool
dtypes: bool(1), float64(1), int64(2), object(3)
memory usage: 957.2+ KB

In [34]:
donaciones.sample(10)

,IDDonacion,IDDonante,Cantidad,FechaDonacion,MetodoDonacion,Comentario,EsAnonimo
15910,15911,10153,886.97,12/11/2020,Bank Transfer,In memory of...,True
17284,17285,5055,624.03,1/06/2020,PayPal,NaN,True
1051,1052,2471,397.98,20/03/2020,Bank Transfer,In memory of...,True
15641,15642,3863,987.12,28/11/2021,Credit Card,NaN,False
13811,13812,18765,186.52,18/10/2018,Credit Card,For a good cause.,False
12155,12156,4606,864.13,4/03/2022,PayPal,For a good cause.,True
1570,1571,14378,450.30,1/03/2019,Credit Card,Keep up the good work!,True
14063,14064,8621,103.12,16/03/2021,Credit Card,NaN,False
4484,4485,7121,129.15,3/02/2021,Credit Card,For a good cause.,True
4559,4560,10645,438.95,8/01/2021,Credit Card,For a good cause.,False

In [35]:
donaciones.nunique()

IDDonacion        20000
IDDonante         12609
Cantidad          18157
FechaDonacion      1826
MetodoDonacion        4
Comentario            3
EsAnonimo             2
dtype: int64

In [37]:
#change date format
donaciones['FechaDonacion'] = pd.to_datetime(donaciones['FechaDonacion'], dayfirst = True)
donaciones.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   IDDonacion      20000 non-null  int64
 1   IDDonante       20000 non-null  int64
 2   Cantidad        20000 non-null  float64
 3   FechaDonacion   20000 non-null  datetime64[ns]
 4   MetodoDonacion  20000 non-null  object
 5   Comentario      11882 non-null  object
 6   EsAnonimo       20000 non-null  bool
dtypes: bool(1), datetime64[ns](1), float64(1), int64(2), object(2)
memory usage: 957.2+ KB

In [38]:
donaciones['MetodoDonacion'].unique()

array(['Bank Transfer', 'Credit Card', 'Cash', 'PayPal'], dtype=object)

Some donners didn't left a comment, however this catogory isn't relevant for the requested analysis.